BAS BMEKZU Project/src/Documents/ИНАГРО_ЛабораторныйАнализ/ИНАГРО_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <attributes>
    <name>Вентилирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЖурнала</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыЖурналов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЛабАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗерноваяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Масличность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОпределенияСтекловидности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Очистка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Происхождение</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ИНАГРО_ПроисхождениеЗерна</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Силос</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЖурнала</name>
    <type>
      <types>CatalogRef.ИНАГРО_ТипыЖурналов</types>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЖурнал</name>
    <type>
      <types>CatalogRef.УдалитьИНАГРО_ЛабораторныеЖурналы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСкладСилос</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСушитьАктивнымВентилированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ЖурналЛабораторныхАнализов/ИНАГРО_ЖурналЛабораторныхАнализов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ЖурналЛабораторныхАнализов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.ИНАГРО_ЛабораторныйАнализ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ИНАГРО_Форма34Сводная</types>
      <types>DocumentRef.ИНАГРО_Перемещение</types>
      <types>DocumentRef.ИНАГРО_ТТНВывоз</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВывозЖД</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВвоз</types>
      <types>DocumentRef.ИНАГРО_АктРаспределения</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВывоз</types>
      <types>DocumentRef.ИНАГРО_ТТНВвоз</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВнутр</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВвозЖД</types>
      <types>DocumentRef.ИНАГРО_ТТНВнутр</types>
      <types>DocumentRef.ИНАГРО_Переоформление</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Documents/ИНАГРО_ЛабораторныйАнализ/Forms/ФормаВводаПараметровВыборки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.Свойство("Организация",        Организация);
	Параметры.Свойство("Склад",              Склад);
	Параметры.Свойство("Владелец",           Владелец);
	Параметры.Свойство("ДоговорКонтрагента", ДоговорКонтрагента);
	Параметры.Свойство("Номенклатура",       Номенклатура);
	Параметры.Свойство("ТипЖурнала",         ТипЖурнала);
	Параметры.Свойство("Урожай",             Урожай);
	Параметры.Свойство("ВидХранения",        ВидХранения);
	Параметры.Свойство("Силос",              Силос);
	Параметры.Свойство("ДатаОкончания",      ДатаОкончания);
	Параметры.Свойство("ДатаНачала",         ДатаНачала); 
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	СтруктураВозврата = Новый Структура("АдресХарактеристикиВХранилище, КвоЛабАнализов");
	
	ЗаполнитьНаСервере(СтруктураВозврата);
	
	Закрыть(СтруктураВозврата);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	ПараметрыФормыВыбора = Новый Структура("НачалоПериода, КонецПериода", ДатаНачала, ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыФормыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала	  = РезультатВыбора.НачалоПериода;
	ДатаОкончания = РезультатВыбора.КонецПериода;		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере(СтруктураВозврата)
	
	Запрос = Новый Запрос;	
	
	Фильтр = "";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Организация В ИЕРАРХИИ(&Организация)"
	КонецЕсли;
	
	Если ДатаНачала <> '00010101000000' И ДатаОкончания <> '00010101000000' Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Дата >= &ДатаНачала И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Дата <= &ДатаОкончания";
	ИначеЕсли ДатаНачала <> '00010101000000' Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Дата >= &ДатаНачала ";
	ИначеЕсли ДатаОкончания <> '00010101000000' Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Дата <= &ДатаОкончания ";		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Владелец В ИЕРАРХИИ(&Владелец)"
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Склад) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Склад  В ИЕРАРХИИ(&Склад)"
	КонецЕсли;

	Если ЗначениеЗаполнено(Силос) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Силос  В ИЕРАРХИИ(&Силос)"
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Номенклатура В ИЕРАРХИИ(&Номенклатура)"
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Урожай) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Урожай  В ИЕРАРХИИ(&Урожай)"
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипЖурнала) Тогда
		Фильтр = Фильтр + " И ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.ТипЖурнала  В ИЕРАРХИИ(&ТипЖурнала)"
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИНАГРО_ЖурналЛабораторныхАнализов.ДокументРегистратор.Ссылка КАК ДокСсылка,
		|	ЕСТЬNULL(ИНАГРО_ЖурналЛабораторныхАнализов.Вес, 0) КАК ФизическийВес,
		|	ЕСТЬNULL(ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Влажность, 0) КАК Влажность,
		|	ЕСТЬNULL(ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.СорнаяПримесь, 0) КАК СорнаяПримесь,
		|	ЕСТЬNULL(ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.ЗерноваяПримесь, 0) КАК ЗерноваяПримесь,
		|	ИНАГРО_ЖурналЛабораторныхАнализов.ЛабораторныйАнализ.Ссылка КАК ЛабораторныйАнализ
		|ИЗ
		|	РегистрСведений.ИНАГРО_ЖурналЛабораторныхАнализов КАК ИНАГРО_ЖурналЛабораторныхАнализов
		|ГДЕ
		|	ИНАГРО_ЖурналЛабораторныхАнализов.Регистратор.Проведен = ИСТИНА" + Фильтр;	
		
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Владелец",      Владелец);
	Запрос.УстановитьПараметр("Склад",         Склад);
	Запрос.УстановитьПараметр("Силос",         Силос);
	Запрос.УстановитьПараметр("Номенклатура",  Номенклатура);
	Запрос.УстановитьПараметр("Урожай",        Урожай);
	Запрос.УстановитьПараметр("ТипЖурнала",    ТипЖурнала);
	Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));	
	
	РезТаблица = Запрос.Выполнить().Выгрузить();
		
	Если РезТаблица.Количество() > 0 Тогда
		
		ТаблицаХарактеристик = Новый ТаблицаЗначений;
		ТаблицаХарактеристик.Колонки.Добавить("Характеристика");
		ТаблицаХарактеристик.Колонки.Добавить("Вес");
		ТаблицаХарактеристик.Колонки.Добавить("ЦентнероПроценты");
		ТаблицаХарактеристик.Колонки.Добавить("КвоЗначенийПоказателя");
		ТаблицаХарактеристик.Колонки.Добавить("КачествоЗерна");
		
		КвоЛабАнализов = 0;
		Для Каждого СтрРезТаблицы Из РезТаблица Цикл
			Для Каждого СтрЛабАнализа Из СтрРезТаблицы.ЛабораторныйАнализ.Результаты Цикл
				Если ТипЗнч(СтрЛабАнализа.Значение) <> Тип("Число") Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = ТаблицаХарактеристик.Добавить();
				НоваяСтрока.Характеристика        = СтрЛабАнализа.Характеристика;
				НоваяСтрока.Вес                   = СтрРезТаблицы.ФизическийВес;
				НоваяСтрока.ЦентнероПроценты      = СтрРезТаблицы.ФизическийВес * СтрЛабАнализа.Значение/100;
				НоваяСтрока.КачествоЗерна	      = СтрЛабАнализа.Значение;
				НоваяСтрока.КвоЗначенийПоказателя = 1;
			КонецЦикла;
			КвоЛабАнализов = КвоЛабАнализов + 1;
		КонецЦикла;
		
		Если КвоЛабАнализов = 1 Тогда
			//
		Иначе
			ТаблицаХарактеристик.Свернуть("Характеристика", "ЦентнероПроценты, КвоЗначенийПоказателя, Вес");
		КонецЕсли;	
		
		СтруктураВозврата.Вставить("АдресХарактеристикиВХранилище", ПоместитьХарактеристикиВХранилище(ТаблицаХарактеристик));
		СтруктураВозврата.Вставить("КвоЛабАнализов",                КвоЛабАнализов);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПоместитьХарактеристикиВХранилище(ТаблицаХарактеристик)

	Возврат ПоместитьВоВременноеХранилище(ТаблицаХарактеристик, УникальныйИдентификатор);

КонецФункции

#КонецОбласти
